In [1]:
import pandas as pd

In [10]:
#Import the json in a dataframe

df = pd.read_json("C:\\Users\Kishan Panchal\Downloads\Course 7 - Data Analysis with Python\C7W1 Activity - In class\Jay (1).json")

In [11]:
#print first 5 rows from the dataframe
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [12]:
#Add a column to the dataframe
#DataFrameName.insert(loc, column, value, allow_duplicates = False)

df.insert(4,"New_Column","NA")

In [13]:
#print first 5 rows from the dataframe
df.head()

   Duration  Pulse  Maxpulse  Calories New_Column
0        60    110       130     409.1         NA
1        60    117       145     479.0         NA
2        60    103       135     340.0         NA
3        45    109       175     282.4         NA
4        45    117       148     406.0         NA

In [14]:
#Perform info on dataframe

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 169 entries, 0 to 168
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Duration    169 non-null    int64
 1   Pulse       169 non-null    int64
 2   Maxpulse    169 non-null    int64
 3   Calories    164 non-null    float64
 4   New_Column  169 non-null    object
dtypes: float64(1), int64(3), object(1)
memory usage: 7.9+ KB

In [15]:
#Perform describe on dataframe

df.describe()

         Duration       Pulse    Maxpulse     Calories
count  169.000000  169.000000  169.000000   164.000000
mean    63.846154  107.461538  134.047337   375.800000
std     42.299949   14.510259   16.450434   266.377134
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

In [16]:
#Export and save this data as cities1.csv
df.to_json("C:\\Users\Kishan Panchal\Downloads\Course 7 - Data Analysis with Python\C7W1 Activity - In class\Jay1.json")

In [ ]:
'''import pandas as pd

#Import the cities.csv file in a dataframe
df1 = pd.read_csv("C:\\Users\Kishan Panchal\Downloads\Course 7 - Data Analysis with Python\C7W1 Activity - In class\cities.csv")

#print first 5 rows from the dataframe
df1.head()

#Add a column to the dataframe
#DataFrameName.insert(loc, column, value, allow_duplicates = False)
df1.insert(10,"New_Column","NA")

#print first 5 rows from the dataframe
df1.head()

#Perform info on dataframe
df1.info()

#Perform describe on dataframe
df1.describe()

#Export and save this data as cities1.csv
df1.to_csv("C:\\Users\Kishan Panchal\Downloads\Course 7 - Data Analysis with Python\C7W1 Activity - In class\cities1.csv")'''

In [ ]:
'''import pandas as pd

#Import the CarSalesByModelStart.xlsx file in a dataframe
df1 = pd.read_excel("C:\\Users\Kishan Panchal\Downloads\Course 7 - Data Analysis with Python\C7W1 Activity - In class\CarSalesByModelStart.xlsx")

#print first 5 rows from the dataframe
df1.head()

#Add a column to the dataframe
#DataFrameName.insert(loc, column, value, allow_duplicates = False)
df1.insert(7,"New_Column","NA")

#print first 5 rows from the dataframe
df1.head()

#Perform info on dataframe
df1.info()

#Perform describe on dataframe
df1.describe()

#Export and save this data as cities1.csv
df1.to_excel("C:\\Users\Kishan Panchal\Downloads\Course 7 - Data Analysis with Python\C7W1 Activity - In class\CarSalesByModelStart1.xlsx")'''

In [ ]:
'''import pandas as pd

#Import the Jay (1).json file in a dataframe
df1 = pd.read_json("C:\\Users\Kishan Panchal\Downloads\Course 7 - Data Analysis with Python\C7W1 Activity - In class\Jay (1).json")

#print first 5 rows from the dataframe
df1.head()

#Add a column to the dataframe
#DataFrameName.insert(loc, column, value, allow_duplicates = False)
df1.insert(4,"New_Column","NA")

#print first 5 rows from the dataframe
df1.head()

#Perform info on dataframe
df1.info()

#Perform describe on dataframe
df1.describe()

#Export and save this data as cities1.csv
df1.to_json("C:\\Users\Kishan Panchal\Downloads\Course 7 - Data Analysis with Python\C7W1 Activity - In class\Jay1.json")'''

In [36]:
import pandas as pd
import numpy as np
d={'Mouse': [150,200,300,400],
   'Keyboard': [180,200,190,300],
   'Scanner': [200,280,330,450]
}

df = pd.DataFrame(d, index = ['Jan', 'Feb', 'March', 'April'])
df

       Mouse  Keyboard  Scanner
Jan      150       180      200
Feb      200       200      280
March    300       190      330
April    400       300      450

In [30]:
#Write code to access data of Mouse and Scanner columns.
df[['Mouse','Scanner']]

       Mouse  Scanner
Jan      150      200
Feb      200      280
March    300      330
April    400      450

In [34]:
#Write code to access data of the Keyboard column using dot notation and column name.
df.loc[:,'Keyboard']

Jan      180
Feb      200
March    190
April    300
Name: Keyboard, dtype: int64

In [35]:
#Write code to access data of scanners using loc[].
df.loc[:,'Scanner']

Jan      200
Feb      280
March    330
April    450
Name: Scanner, dtype: int64

In [41]:
# Write code to access data of all columns where mouse data is more than 200.
df[df['Mouse']>200]

       Mouse  Keyboard  Scanner
March    300       190      330
April    400       300      450

In [42]:
# Write code to access columns using 0 and 2.
df.iloc[0,2]

200

In [44]:
# Write code to access data of rows of jan and march for scanner and keyboard
df.loc[['Jan','March'],['Scanner','Keyboard']]

       Scanner  Keyboard
Jan        200       180
March      330       190